Import Library

In [2]:
import numpy as np
import pandas as pd

# Creating Series
Series adalah koleksi data seperti list dan array 1 dimensi, yang bisa menampung hanya satu tipe data. Series memiliki nama dan label pada index.

In [4]:
myList=[10,20,30]
labels=['a','b','c']

In [5]:
#from list
pd.Series(myList) #secara default index dimulai dari 0

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(myList,labels) #kalau mau ubah label index

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(index=labels,data=myList) #diingat, pada pemakaian function, jika kita memasukan argumen secara acak, tulis nama parameternya

a    10
b    20
c    30
dtype: int64

In [8]:
#from array
arr=np.array([10,20,30])
arr

array([10, 20, 30])

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [12]:
#from Dictionary
myDict={'a':10,'b':20,'c':30}
myDict

{'a': 10, 'b': 20, 'c': 30}

In [13]:
pd.Series(myDict) #key akan menjadi label index pada series

a    10
b    20
c    30
dtype: int64

# Creating DataFrame
DataFrame adalah kumpulan dari series. Bentuknya seperti tabel, dengan baris dan kolom, di mana tiap kolom berisi satu jenis variabel dan tiap baris berisi satu observasi.

In [15]:
# from lists
kota=['Jakarta','Surabaya','Bandung']
toko=[4,2,2]
penjualan=[1000,6000,8000]

In [20]:
pd.DataFrame(data=[kota,toko,penjualan]) #secara default, maka tiap list akan menjadi 1 baris, 
# padahal biasanya kita ingin tiap list menjadi 1 kolom, karena tiap kolom adalah 1 variabel

         0         1        2
0  Jakarta  Surabaya  Bandung
1        4         2        2
2     1000      6000     8000

In [22]:
pd.DataFrame(data=[kota,toko,penjualan])[0] #perhatikan data tipe

0    Jakarta
1          4
2       1000
Name: 0, dtype: object

In [18]:
pd.DataFrame(list(zip(kota,toko,penjualan))) #Zip untuk membuat tuple berisikan data di posisi tertentu secara berurutan dari beberapa list

          0  1     2
0   Jakarta  4  1000
1  Surabaya  2  6000
2   Bandung  2  8000

In [24]:
pd.DataFrame(list(zip(kota,toko,penjualan)))[1] #perhatikan data type

0    4
1    2
2    2
Name: 1, dtype: int64

In [26]:
pd.DataFrame(list(zip(kota,toko,penjualan)),columns=['kota','toko','penjualan'],index='a b c'.split()) #memberi label pada kolom dan index

       kota  toko  penjualan
a   Jakarta     4       1000
b  Surabaya     2       6000
c   Bandung     2       8000

In [19]:
pd.DataFrame([kota,toko,penjualan]).T #Transpose

          0  1     2
0   Jakarta  4  1000
1  Surabaya  2  6000
2   Bandung  2  8000

In [29]:
# from list
myList=[[1,2,3,4],
       [5,6,7,8],
       [9,10,11,12]]
myList

[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]

In [30]:
pd.DataFrame(myList) #tiap list di dalam list menjadi 1 baris

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [32]:
pd.DataFrame(myList,index='a b c'.split(),columns='w x y z'.split()).T #transpose

   a  b   c
w  1  5   9
x  2  6  10
y  3  7  11
z  4  8  12

In [33]:
#From Array
mat=np.arange(1,25).reshape(4,-1)

In [34]:
mat

array([[ 1,  2,  3,  4,  5,  6],
       [ 7,  8,  9, 10, 11, 12],
       [13, 14, 15, 16, 17, 18],
       [19, 20, 21, 22, 23, 24]])

In [35]:
pd.DataFrame(mat,columns=['a','b','c','d','e','f'], index='w x y z'.split())

    a   b   c   d   e   f
w   1   2   3   4   5   6
x   7   8   9  10  11  12
y  13  14  15  16  17  18
z  19  20  21  22  23  24

In [38]:
# from Dict
myDict={
    'Kota':['Jakarta','Surabaya','Bandung'],
    'Toko':[4,2,2],
    'Penjualan':[10000,6000,8000]
}
myDict

{'Kota': ['Jakarta', 'Surabaya', 'Bandung'],
 'Toko': [4, 2, 2],
 'Penjualan': [10000, 6000, 8000]}

In [39]:
pd.DataFrame(myDict, index='a b c'.split()) #key pada dictionary akan menjadi nama kolom

       Kota  Toko  Penjualan
a   Jakarta     4      10000
b  Surabaya     2       6000
c   Bandung     2       8000

In [41]:
pd.DataFrame(
    {
    'Kota':['Jakarta','Surabaya','Bandung'],
    'Toko':[4,2,2],
    'Penjualan':[10000,6000,8000,12000]
    }
) #Panjang data pada tiap key dictionary/list harus sama, kalau tidak error

ValueError: arrays must all be same length

In [ ]:
**EXERCISE**
Buatlah dataframe berikut, simpan di variabel df

In [42]:
df=pd.DataFrame({'name': ['Raven Bierman', 'Valter Havers', 'Marko Mendell', 'Takahiro Momota','Yahiko Tilemans', 'Dina Rebaine'],
    'gender': ['Female','Male','Male','Male','Male','Female'],
    'hire date': ['2016-12-04','2018-04-13','2018-07-04','2016-11-18','2017-05-26','2015-03-20'],
    'gross salary':[7000000,7000000,15000000,12000000,20000000,15000000]},
    index=[100111,100112,200210,200211,200312,300207])
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

# INDEXING and SELECTION

In [44]:
df['name'] #menampilkan kolom name dari dataframe df #perhatikan kalau nama kolom case sensitive

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
300207       Dina Rebaine
Name: name, dtype: object

In [45]:
df['name'][200211] #menampilkan nama karyawan pada index 200211

'Takahiro Momota'

In [50]:
df['name'][[100111,200210]] #fancy indexing

100111    Raven Bierman
200210    Marko Mendell
Name: name, dtype: object

In [51]:
contoh=pd.DataFrame(myList)
contoh

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [53]:
contoh[0][0:2] #slicing

0    1
1    5
Name: 0, dtype: int64

In [56]:
type(df['name']) #data tipe berupa series

pandas.core.series.Series

In [57]:
df[['name','gross salary']] #memanggil lebih dari 1 kolom, perhartikan jumlah kurung siku

                   name  gross salary
100111    Raven Bierman       7000000
100112    Valter Havers       7000000
200210    Marko Mendell      15000000
200211  Takahiro Momota      12000000
200312  Yahiko Tilemans      20000000
300207     Dina Rebaine      15000000

In [59]:
df.name #attribut access, tidak disarankan

100111      Raven Bierman
100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
300207       Dina Rebaine
Name: name, dtype: object

In [61]:
contoh['min']=[22,23,34]

In [62]:
contoh

   0   1   2   3  min
0  1   2   3   4   22
1  5   6   7   8   23
2  9  10  11  12   34

In [63]:
contoh.min #output aneh, karena min merupakan nama method

<bound method DataFrame.min of    0   1   2   3  min
0  1   2   3   4   22
1  5   6   7   8   23
2  9  10  11  12   34>

In [66]:
contoh['min'] #lebih disarankan

0    22
1    23
2    34
Name: min, dtype: int64

In [68]:
# loc
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [69]:
df.loc[200210] #untuk memanggil data berdasarkan index/barisnya #perhatikan penulisannya, .loc memakai []

name            Marko Mendell
gender                   Male
hire date          2018-07-04
gross salary         15000000
Name: 200210, dtype: object

In [71]:
df.loc[100112:200211] #slicing berdasarkan label index. 
#Perhatikan tidak seperti slicing biasanya, data pada index 200211 ikut dipanggil

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200210    Marko Mendell   Male  2018-07-04      15000000
200211  Takahiro Momota   Male  2016-11-18      12000000

In [72]:
df.loc[200210]['hire date'] #hire date dari karyawan dengan nomor index 200210

'2018-07-04'

In [73]:
#iloc
df.iloc[2] #memanggil data berdasarkan *posisi* index/kolom

name            Marko Mendell
gender                   Male
hire date          2018-07-04
gross salary         15000000
Name: 200210, dtype: object

In [74]:
df.iloc[:,1] #memanggil data pada kolom pertama

100111    Female
100112      Male
200210      Male
200211      Male
200312      Male
300207    Female
Name: gender, dtype: object

In [80]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [76]:
df.iloc[0::2] #slicing [start, stop, step] #slicing dari awal sampai selesai (0::), 2--> step 2/ lompat 1 data

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000

In [77]:
df.iloc[:,0:2] #memanggil 2 kolom pertama

                   name  gender
100111    Raven Bierman  Female
100112    Valter Havers    Male
200210    Marko Mendell    Male
200211  Takahiro Momota    Male
200312  Yahiko Tilemans    Male
300207     Dina Rebaine  Female

In [78]:
df.iloc[1,3] #memanggil data pada posisi baris index 1, dan kolom index 3

7000000

In [79]:
df.iloc[[1,3]] #perhatikan bedanya dengan di atas, yg ini fancy indexing

                   name gender   hire date  gross salary
100112    Valter Havers   Male  2018-04-13       7000000
200211  Takahiro Momota   Male  2016-11-18      12000000

# Conditional Selection

In [82]:
contoh2=pd.DataFrame(np.arange(0,20).reshape(4,-1))
contoh2

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [84]:
contoh2>10 #cek apakah data di contoh2 lebih besar 10, ouput berupa boolean

       0      1      2      3      4
0  False  False  False  False  False
1  False  False  False  False  False
2  False   True   True   True   True
3   True   True   True   True   True

In [85]:
contoh2[contoh2>10] #untuk memanggil datanya, maka masukkan kondisi sebagai index

      0     1     2     3     4
0   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN   NaN   NaN
2   NaN  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [86]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [87]:
df['gender']=='Female' #apakah data karyawan tertentu di df gendernya female

100111     True
100112    False
200210    False
200211    False
200312    False
300207     True
Name: gender, dtype: bool

In [88]:
df[df['gender']=='Female'] #karyawan mana saja yg gendernya female

                 name  gender   hire date  gross salary
100111  Raven Bierman  Female  2016-12-04       7000000
300207   Dina Rebaine  Female  2015-03-20      15000000

In [89]:
df[df['gender']=='Female']['name'] #nama karyawan yg genderenya female

100111    Raven Bierman
300207     Dina Rebaine
Name: name, dtype: object

In [90]:
df[df['gender']=='Female'][['name','gross salary']] #nama dan gaji karyawan yang gendernya female. Perhatikan jumlah kurung siku di akhir

                 name  gross salary
100111  Raven Bierman       7000000
300207   Dina Rebaine      15000000

In [96]:
df[(df['gender']=='Female') & (df['gross salary']> 10000000)]['name']
#nama karyawan yang gendernya female dan gross salarynya di atas 10 juta
#kalau menggunakan lebih dari 1 kondisi, kondisi yang dipakai dimasukan di dalam () dan dipisahkan dengan & (untuk AND) atau | (untuk OR)

300207    Dina Rebaine
Name: name, dtype: object

In [97]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [98]:
# tampilkan kolom nama dan hire date
df[['name','hire date']]

                   name   hire date
100111    Raven Bierman  2016-12-04
100112    Valter Havers  2018-04-13
200210    Marko Mendell  2018-07-04
200211  Takahiro Momota  2016-11-18
200312  Yahiko Tilemans  2017-05-26
300207     Dina Rebaine  2015-03-20

In [100]:
# tampilkan nama karyawan dengan index 200312
df.loc[200312]['name']

'Yahiko Tilemans'

In [102]:
#tampilkan data di baris posisi 4
df.iloc[3]

name            Takahiro Momota
gender                     Male
hire date            2016-11-18
gross salary           12000000
Name: 200211, dtype: object

In [103]:
# tampilkan data dari karyawan yang bernama Marko Mendell
df[df['name']=='Marko Mendell']

                 name gender   hire date  gross salary
200210  Marko Mendell   Male  2018-07-04      15000000

In [104]:
# tampilkan nama dan gender dari karyawan yang gross salary di bawah atau sama dengan 10 juta
df[df['gross salary']<=10000000][['name','gender']]

                 name  gender
100111  Raven Bierman  Female
100112  Valter Havers    Male

In [106]:
# tampilkan nama dari karyawan yang gendernya male
df[df['gender']=='Male']['name']

100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
Name: name, dtype: object

In [108]:
df.loc[df['gender']=='Male']['name'] # .loc bisa juga dimasukan dengan kondisi

100112      Valter Havers
200210      Marko Mendell
200211    Takahiro Momota
200312    Yahiko Tilemans
Name: name, dtype: object

In [109]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [111]:
# tampilkan data di posisi baris index 3 dan posisi kolom index 2
df.iloc[3,2] #baris, kolom

'2016-11-18'

In [113]:
df.iloc[3][2]

'2016-11-18'

In [116]:
df.iloc[[3,2]] #fancy indexing di baris

                   name gender   hire date  gross salary
200211  Takahiro Momota   Male  2016-11-18      12000000
200210    Marko Mendell   Male  2018-07-04      15000000

In [117]:
#tampilkan data di label index 200210 sampai 200312
df.loc[200210:200312]

                   name gender   hire date  gross salary
200210    Marko Mendell   Male  2018-07-04      15000000
200211  Takahiro Momota   Male  2016-11-18      12000000
200312  Yahiko Tilemans   Male  2017-05-26      20000000

In [119]:
# tampilkan nama dan gender dari karyawan dengan gross salary 7000000
df[df['gross salary']==7000000][['name','gender']]

                 name  gender
100111  Raven Bierman  Female
100112  Valter Havers    Male

In [120]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [121]:
df.iloc[3,[0,3]] #data di baris 3 dan kolom 0 dan 3
#output?

name            Takahiro Momota
gross salary           12000000
Name: 200211, dtype: object

In [128]:
df[['gender','gross salary']].loc[200211]
#output?

gender              Male
gross salary    12000000
Name: 200211, dtype: object

In [129]:
df[['gender','gross salary']].iloc[3]

gender              Male
gross salary    12000000
Name: 200211, dtype: object

In [130]:
# ouput: 2018-04-13
df.iloc[1,2]

'2018-04-13'

In [132]:
df

                   name  gender   hire date  gross salary
100111    Raven Bierman  Female  2016-12-04       7000000
100112    Valter Havers    Male  2018-04-13       7000000
200210    Marko Mendell    Male  2018-07-04      15000000
200211  Takahiro Momota    Male  2016-11-18      12000000
200312  Yahiko Tilemans    Male  2017-05-26      20000000
300207     Dina Rebaine  Female  2015-03-20      15000000

In [134]:
df.loc[100112]['hire date']

'2018-04-13'

In [135]:
df['hire date'][100112]

'2018-04-13'

In [137]:
df[['hire date']]

         hire date
100111  2016-12-04
100112  2018-04-13
200210  2018-07-04
200211  2016-11-18
200312  2017-05-26
300207  2015-03-20